<template>
  <!--обёртка для всего содержимого, чтобы прижать footer к нижней части-->
  <div class="wrapper wrapper-forcontent">
    <!--Содержимое сайта без подвала (нужно для прижатия подвала к нижней части)-->
    <div class="content-without-footer">
      <!--Шапка сайта-->
      <header class="header">
        <nav class="header-secondmenu">
          <MenuRouter class="header-secondmenu-route" :colorElement="colorElement" />
          <ModalFeedback class="header-secondmenu-feedback" />
          <MenuSocial class="header-secondmenu-social" />
        </nav>
        <div class="header-info">
          <img src="../assets/logo_aquatica.svg" alt="logo">
          <span class="header-info-text">Путешествие в тысячу миль</span>
          <span class="header-info-text">Начинается с первого клика</span>
          <button class="header-info-btn">Хочу нырять...</button>
          <div class="header-info-details">
            <span class="header-info-details-text">
              <svg class="header-info-details-text-svg" width="18" height="20" viewbox="0 0 18 20">
                <path d="M0 18.125C0 19.1602 0.863839 20 1.92857 20H16.0714C17.1362 20 18 19.1602 18 18.125V7.5H0V18.125ZM12.8571 10.4688C12.8571 10.2109 13.0741 10 13.3393 10H14.9464C15.2116 10 15.4286 10.2109 15.4286 10.4688V12.0312C15.4286 12.2891 15.2116 12.5 14.9464 12.5H13.3393C13.0741 12.5 12.8571 12.2891 12.8571 12.0312V10.4688ZM12.8571 15.4688C12.8571 15.2109 13.0741 15 13.3393 15H14.9464C15.2116 15 15.4286 15.2109 15.4286 15.4688V17.0312C15.4286 17.2891 15.2116 17.5 14.9464 17.5H13.3393C13.0741 17.5 12.8571 17.2891 12.8571 17.0312V15.4688ZM7.71429 10.4688C7.71429 10.2109 7.93125 10 8.19643 10H9.80357C10.0687 10 10.2857 10.2109 10.2857 10.4688V12.0312C10.2857 12.2891 10.0687 12.5 9.80357 12.5H8.19643C7.93125 12.5 7.71429 12.2891 7.71429 12.0312V10.4688ZM7.71429 15.4688C7.71429 15.2109 7.93125 15 8.19643 15H9.80357C10.0687 15 10.2857 15.2109 10.2857 15.4688V17.0312C10.2857 17.2891 10.0687 17.5 9.80357 17.5H8.19643C7.93125 17.5 7.71429 17.2891 7.71429 17.0312V15.4688ZM2.57143 10.4688C2.57143 10.2109 2.78839 10 3.05357 10H4.66071C4.92589 10 5.14286 10.2109 5.14286 10.4688V12.0312C5.14286 12.2891 4.92589 12.5 4.66071 12.5H3.05357C2.78839 12.5 2.57143 12.2891 2.57143 12.0312V10.4688ZM2.57143 15.4688C2.57143 15.2109 2.78839 15 3.05357 15H4.66071C4.92589 15 5.14286 15.2109 5.14286 15.4688V17.0312C5.14286 17.2891 4.92589 17.5 4.66071 17.5H3.05357C2.78839 17.5 2.57143 17.2891 2.57143 17.0312V15.4688ZM16.0714 2.5H14.1429V0.625C14.1429 0.28125 13.8536 0 13.5 0H12.2143C11.8607 0 11.5714 0.28125 11.5714 0.625V2.5H6.42857V0.625C6.42857 0.28125 6.13929 0 5.78571 0H4.5C4.14643 0 3.85714 0.28125 3.85714 0.625V2.5H1.92857C0.863839 2.5 0 3.33984 0 4.375V6.25H18V4.375C18 3.33984 17.1362 2.5 16.0714 2.5Z"/>
              </svg>
              Работаем с 2009 года
            </span>
            <span class="header-info-details-text">
              <svg class="header-info-details-text-svg" width="23" height="17" viewbox="0 0 23 17">
                <path d="M23 16.2917C23 16.4835 22.9289 16.6495 22.7866 16.7897C22.6444 16.9299 22.4759 17 22.2812 17C22.0866 17 21.9181 16.9299 21.7759 16.7897C21.6336 16.6495 21.5625 16.4835 21.5625 16.2917V6.97266L13.6338 10.8906C13.0348 11.1858 12.3236 11.3333 11.5 11.3333C10.6764 11.3333 9.96517 11.1858 9.36621 10.8906L0.875977 6.70703C0.291992 6.41189 0 6.06141 0 5.6556C0 5.24978 0.291992 4.90668 0.875977 4.6263L9.36621 0.442708C9.96517 0.147569 10.6764 0 11.5 0C12.3236 0 13.0348 0.147569 13.6338 0.442708L22.124 4.6263C22.6331 4.87717 22.9176 5.18707 22.9775 5.55599C22.9925 5.57075 23 5.60026 23 5.64453V16.2917ZM14.3525 12.3073L18.6875 10.1602V13.2812C18.6875 13.9158 17.9875 14.4581 16.5874 14.9082C15.1873 15.3583 13.4915 15.5833 11.5 15.5833C9.50846 15.5833 7.81266 15.3583 6.4126 14.9082C5.01253 14.4581 4.3125 13.9158 4.3125 13.2812V10.1602L8.64746 12.3073C9.24642 12.6024 10.1973 12.75 11.5 12.75C12.8027 12.75 13.7536 12.6024 14.3525 12.3073Z"/>
              </svg>
              Более 2500 учеников
            </span>
          </div>
        </div>
        <ol class="header-cards">
          <li class="header-cards-li">
            <span class="header-cards-li-title">
              <svg class="header-cards-li-title-svg" width="20" height="19" viewbox="0 0 20 19">
                <path d="M16.9 2.21667C16.0667 2.03333 15.45 1.04167 14.6417 0.866666C13.8334 0.691666 12.8334 1.325 12.0167 1.14167C11.5871 0.990528 11.129 0.937528 10.6762 0.986557C10.2234 1.03559 9.78737 1.1854 9.40004 1.425L9.34171 13.3333L9.16671 14.1667C8.86671 15.5167 9.72504 16.85 11.075 17.15C12.4167 17.4417 13.75 16.5917 14.05 15.2417L14.225 14.4083L19.1667 3.56667C18.9154 3.18506 18.5809 2.86535 18.1883 2.63154C17.7957 2.39773 17.3553 2.25589 16.9 2.21667ZM12.425 14.8833C12.325 15.3417 11.875 15.6333 11.4167 15.5417C10.95 15.4417 10.6584 15 10.7584 14.525L11.475 11.25C11.5182 11.0376 11.6424 10.8504 11.8214 10.728C12.0003 10.6057 12.2198 10.5579 12.4334 10.5948C12.647 10.6316 12.8378 10.7503 12.9654 10.9255C13.093 11.1007 13.1472 11.3187 13.1167 11.5333C13.1167 11.5667 13.1084 11.5917 13.1 11.625L12.425 14.8833ZM8.10004 16.95C7.77504 16.4417 7.56671 15.875 7.50004 15.2833L6.86671 12.5C6.75004 12.0583 7.00837 11.6 7.50004 11.4667C7.56087 11.4583 7.62255 11.4583 7.68337 11.4667V2.025C6.92504 2.025 6.01671 1.55 5.31671 1.71667C4.61671 1.88333 3.90837 2.86667 3.10004 3.05C2.17504 3.13333 1.34171 3.625 0.833374 4.4L5.77504 15.2333L5.95004 16.0667C6.09228 16.7138 6.48534 17.2781 7.04304 17.6358C7.60074 17.9936 8.27754 18.1155 8.92504 17.975H9.00837C8.65004 17.6833 8.33337 17.3417 8.10004 16.95Z" />
              </svg>
              <span class="header-cards-li-title-text">Доступный дайвинг</span>
            </span>
            <p class="header-cards-li-text">Акции и горячие предложения на курсы обучения.</p>
            <router-link class="header-cards-li-router" to="#">Узнать больше</router-link>
          </li>
          <li class="header-cards-li">
            <span class="header-cards-li-title">
              <svg class="header-cards-li-title-svg" width="20" height="18" viewbox="0 0 20 18">
                <path d="M10 0C15.5 0 20 3.58 20 8C20 12.42 15.5 16 10 16C8.76 16 7.57 15.82 6.47 15.5C3.55 18 0 18 0 18C2.33 15.67 2.7 14.1 2.75 13.5C1.05 12.07 0 10.13 0 8C0 3.58 4.5 0 10 0Z"/>
              </svg>
              <span class="header-cards-li-title-text">Онлайн запись</span>
            </span>
            <p class="header-cards-li-text">Оставьте свой вопрос, мы перезвоним и проконсультируем вас.</p>
            <router-link class="header-cards-li-router" to="#">Оставить вопрос</router-link>
          </li>
          <li class="header-cards-li">
            <span class="header-cards-li-title">
              <svg class="header-cards-li-title-svg" width="14" height="21" viewBox="0 0 14 21">
                <path d="M9 0H2C1.46957 0 0.960859 0.210714 0.585786 0.585786C0.210714 0.960859 0 1.46957 0 2V16C0 16.5304 0.210714 17.0391 0.585786 17.4142C0.960859 17.7893 1.46957 18 2 18H5V21L7 20L9 21V18H12C12.5304 18 13.0391 17.7893 13.4142 17.4142C13.7893 17.0391 14 16.5304 14 16V5L9 0ZM9 13V15L7 14L5 15V13L3 12L5 11V9L7 10L9 9V11L11 12L9 13ZM8 6V1.5L12.5 6H8Z"/>
              </svg>
              <span class="header-cards-li-title-text">Сертификаты</span>
            </span>
            <p class="header-cards-li-text">Дайвинг в подарок для ваших друзей и знакомых.</p>
            <router-link class="header-cards-li-router" to="#">Приобрести</router-link>
          </li>
        </ol>
      </header>

      <!--Основная часть-->
      <main>
        <!--Первая секция основной части-->
        <article class="direct">
          <h2 class="direct-discription">Обучение дайвингу в Москве</h2>
          <h1 class="direct-title">Дайвинг <span class="direct-title-el">в Москве</span></h1>
          <p class="direct-text">Добро пожаловать! На страницах нашего сайта вы найдете качественную, нужную информацию касаемо вашего увлечения. Более подробно о нас вам расскажут разделы нашего сайта, благодаря отзывам, отчетам, статьям вы познакомитесь с нами поближе, узнаете, что дайвинг в Москве это реальность. Много полезной информации вам предоставит социальный блог «Акватика» там же, вы можете размещать свои отчеты и отзывы о путешествиях, а так же находить новых друзей по увлечению. Для прямого общения он-лайн, приглашаем Вас на тематический форум и в соц сети, где "живут" участники клуба которые всегда рады новым знакомствам.</p>
        </article>
        <!--Вторая секция-->
        <section>
          <NewsInfo />
        </section>
      </main>
    </div>

    <!--Подвал сайта-->
    <FooterBlock />
  </div>
</template>

<script>
import MenuRouter from '../components/MenuRouter.vue'
import MenuSocial from '../components/MenuSocial.vue'
import ModalFeedback from '../components/ModalFeedback.vue'

import NewsInfo from '../components/NewsInfo.vue'

import FooterBlock from '@/components/Footer.vue'

export default {
  name: 'HomeView',
  components: {
    MenuRouter,
    MenuSocial,
    ModalFeedback,
    NewsInfo,
    FooterBlock
  },

  data: () => ({
    colorElement: 'white',
    findingElement: 'footer'
  })
}
</script>

<style src="../scss/style.scss" lang="scss" scoped />
